/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   solve.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tmlkshk <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/14 19:07:59 by tmlkshk           #+#    #+#             */
/*   Updated: 2019/12/14 19:08:02 by tmlkshk          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

1 генерация карты (от кол-ва тетры сайз на сайз меньше чем тетраминки на 4)
2 рисуем карту точками
3 заводим поз т_поинт
4 в пределах карты (размер сайза) шагаем по иксу и потом игреку и смотрим точка есть - пищем
решетку а если нет двигаем вправо
потом вниз
если не выходит
стираем текущую карту и генерируем на 1 больше

